Revit 2026 API

# BRepBuilderSurfaceGeometryCreateNURBSSurface(Int32, Int32, IListDouble, IListDouble, IListXYZ, IListDouble, Boolean, BoundingBoxUV) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static BRepBuilderSurfaceGeometry CreateNURBSSurface(
	int degreeU,
	int degreeV,
	IList<double> knotsU,
	IList<double> knotsV,
	IList<XYZ> controlPoints,
	IList<double> weights,
	bool bReverseOrientation,
	BoundingBoxUV surfaceEnvelope
)
```
```vb
Public Shared Function CreateNURBSSurface (
	degreeU As Integer,
	degreeV As Integer,
	knotsU As IList(Of Double),
	knotsV As IList(Of Double),
	controlPoints As IList(Of XYZ),
	weights As IList(Of Double),
	bReverseOrientation As Boolean,
	surfaceEnvelope As BoundingBoxUV
) As BRepBuilderSurfaceGeometry
```
```cpp
public:
static BRepBuilderSurfaceGeometry^ CreateNURBSSurface(
	int degreeU,
	int degreeV,
	IList<double>^ knotsU,
	IList<double>^ knotsV,
	IList<XYZ^>^ controlPoints,
	IList<double>^ weights,
	bool bReverseOrientation,
	BoundingBoxUV^ surfaceEnvelope
)
```
```fsharp
static member CreateNURBSSurface :
        degreeU : int *
        degreeV : int *
        knotsU : IList<float> *
        knotsV : IList<float> *
        controlPoints : IList<XYZ> *
        weights : IList<float> *
        bReverseOrientation : bool *
        surfaceEnvelope : BoundingBoxUV -> BRepBuilderSurfaceGeometry
```

#### Parameters

degreeU Int32

degreeV Int32

knotsU IListDouble

knotsV IListDouble

controlPoints IListXYZ

weights IListDouble

bReverseOrientation Boolean

surfaceEnvelope BoundingBoxUV

#### Return Value

BRepBuilderSurfaceGeometry

#### Reference

BRepBuilderSurfaceGeometry Class

CreateNURBSSurface Overload

Autodesk.Revit.DB Namespace